/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstlen.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: umoff <umoff@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/03 21:32:39 by umoff             #+#    #+#             */
/*   Updated: 2020/02/03 21:32:41 by umoff            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Подсчет длинны списка
*/

int	ft_lstlen(t_list **lst)
{
	t_list	*temp;
	int		len;

	len = 0;
	temp = *lst;
	while (temp)
	{
		temp = temp->next;
		len++;
	}
	return (len);
}
